# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)

n = int(input('Введите количество элементов в массиве: '))
print(f'Введите {n} элементов массива через enter: ')
list_1 = [int(input()) for _ in range(n)]
 
min = int(input('Введите минимальный элемент отображаемого диапазона: '))
max = int(input('Введите максимальный элемент отображаемого диапазона: '))

print('Индексы элементов массива, значения которых принадлежат заданному диапазону: ')
for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        print(i, end=' ')